/*
 *    =====-----=====-----=====-----=====-----=====
 * ||スクリプト解説用のメモなのでアタッチしないこと!||
 *    =====-----=====-----=====-----=====-----=====
 * 
 * =====-----=====
 * 変更点(11/14時点)
 * 
 * =====-----=====
 * はじめに
 * 
 * 　ここは各スクリプト上部に記述されているコメントの見方などを説明しています。
 * 　
 * 　各スクリプトのコメントは基本的に書き換えNGとさせていただきます。
 * 　例外として、
 * 　　・スクリプトのアタッチ先の変更(各自のシーンでの利用の際は除く)
 * 　　・アタッチしているオブジェクト等の名称変更(各自のシーンでの利用の際は除く)
 * 　　・スクリプト自体の改変による機能の増減
 * 　以上3点を変更した際には、該当部分を書き換えたうえでDiscord上で通知をお願いいたします。
 * 　
 * 　その他、不明点等があった場合も同様にDiscord上で連絡をお願いいたします。
 * 　
 * =====-----=====
 * 各スクリプト上のコメントの読み方について
 * 
 *
 * ||クラス名()
 * ||　※注意事項(必要要件)の記述
 * ||　　(注意事項を守らないとエラーが起こります。必ずチェックしてください。)
 * ||
 * ||　＿参照及び利用可能な変数(型)
 * ||
 * ||　＿＿参照不可な変数(型)
 * ||
 * ||　＝参照及び利用可能なメソッド名(引数)
 * ||　　＝機能説明
 * ||
 * ||  ＝＝現在参照不可なメソッド名(引数)
 * ||　　＝機能説明
 * ||
 * ||アタッチされているオブジェクト名(箇条書き)
 * 
 * 上記のように記述しますので参考にしてください。
 * 
 * 以下、テンプレートです。
 * 
 * -------------------------
 * 
 * ||
 * ||
 * || ※
 * ||
 * || _
 * ||
 * || __
 * || 
 * || =
 * ||  =
 * ||
 * || ==
 * ||   =
 * ||
 * ||
 * 
 * -------------------------
*/